
// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

//Console.WriteLine("Введите число:");
//int numberA = int.Parse(Console.ReadLine());
//Console.WriteLine("Введите число:");
//int numberB = int.Parse(Console.ReadLine());

//if (numberA > numberB) ;
//{
//  Console.WriteLine("max: " + numberA);
//}
//if (numberA < numberB) ;
//{
//  Console.WriteLine("min: " + numberB);
//}

//Console.WriteLine("Введите число:");
//int numberA = int.Parse(Console.ReadLine());
//Console.WriteLine("Введите число:");
//int numberB = int.Parse(Console.ReadLine());
//int result = numberB * numberB;

//if (result == numberA) 
//{
//  Console.WriteLine("yes: ");
//}
//else
//{
//  Console.WriteLine("no: ");
//}



Console.WriteLine("Введите число:");
int numberA = int.Parse(Console.ReadLine());

if (numberA == 1)
{
  Console.WriteLine("понед");
}
if (numberA == 2)
{
  Console.WriteLine("вторн");
}
if (numberA == 3)
{
  Console.WriteLine("среда");
}
if (numberA == 4)
{
  Console.WriteLine("четверг");
}
if (numberA == 5)
{
  Console.WriteLine("пятница");
}